/**
 * Alipay.com Inc.
 * Copyright (C) 2004-2018 All Rights Reserved.
 */
package com.sssr.tree.trie;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;
import java.util.regex.Pattern;

import org.apache.commons.lang3.StringUtils;

/**
 * @author zhaojun.wzj
 * @version $Id SensitiveService.java, v 0.1 2018-10-24 11:10 zhaojun.wzj Exp $$
 */
public class SensitiveService {

    private static class TrieNode {

        private boolean                  end      = false;

        private Map<Character, TrieNode> subNodes = new HashMap<Character, TrieNode>();

        public void addNode(Character key, TrieNode node) {
            subNodes.put(key, node);
        }

        public TrieNode getSubNode(Character key) {
            return subNodes.get(key);
        }

        public boolean isKeywordEnd() {
            return end;
        }

        public void setKeywordEnd(boolean end) {
            this.end = end;
        }

        public int getSubNodeCount() {
            return subNodes.size();
        }

    }

    private TrieNode rootNode = new TrieNode();

    private void addWord(String lineText) {
        TrieNode tempNode = rootNode;
        for (int i = 0; i < lineText.length(); i++) {
            Character word = lineText.charAt(i);
            TrieNode node = tempNode.getSubNode(word);

            if (node == null) {
                node = new TrieNode();
                tempNode.addNode(word, node);
            }
            tempNode = node;
            if (i == lineText.length() - 1) {
                tempNode.setKeywordEnd(true);
            }
        }
    }

    private boolean check(String text) {
        if (StringUtils.isEmpty(text)) {
            return false;
        }

        TrieNode tempNode = rootNode;
        int begin = 0, position = 0;
        while (position < text.length()) {
            char word = text.charAt(position);
            tempNode = tempNode.getSubNode(word);
            if (tempNode == null) {
                position = begin + 1;
                begin = position;

                // 重新从rootNode开始
                tempNode = rootNode;
            } else if (tempNode.isKeywordEnd()) {
//                System.out.println("begin:" + begin + ",end:" + (position + 1) + ", text:" + text.substring(begin, position + 1));
                position = position + 1;
                begin = position;

                // 重新从rootNode开始
                tempNode = rootNode;

                return true;
            } else {
                position++;
            }
        }

        return false;
    }

    public static void main(String[] args) throws Exception {
        List<String> kws = new ArrayList<String>();

        kws.add("AV");
        kws.add("中国");
        kws.add("美国");
        kws.add("绿色");
        kws.add("我们");
        kws.add("你们");
        kws.add("他们");
        kws.add("扩展");
        kws.add("敏感词");
        kws.add("读取");
        kws.add("文件");
        kws.add("分隔符");
        kws.add("过滤");
        String text = "安门事,八九民,八九学,八九政治,办本科,办理本科,办理票据,办理文凭,办理真实,办理证书,办文凭,办证,半刺刀,辦證,谤罪获刑,磅解码器,磅遥控器,保过答案,报复执法,爆发骚,北省委门,本公司担,本无码,冰火九重,波推龙,博彩娱,不思四化,插屁屁,成人片,成人视,成人图,成人文,成人小,出售发票,春水横溢,催情粉,催情药,催情藥,打飞机专,打砸办公,大鸡巴,大雞巴,大纪元,大奶子,大肉棒,代办发票,代办各,代办文,代办学,代办制,代開,代考,代理发票,代理票据,代您考,代您考,代写毕,代写论,代孕,党后萎,东北独立,东京热,東京熱,洞小口紧,独立台湾,赌球网,恶势力操,恶势力插,二奶大,发牌绝,发票出,发票代,发票销,法车仑,法伦功,法轮,法轮佛,法正乾,防电子眼,防身药水,房贷给废,肛交,肛门是邻,港澳博球,搞媛交,各类文凭,公安错打,公安网监,公开小姐,攻官小姐,共狗,共王储,滚圆大乳,国家妓,和狗性,和狗做,胡江内斗,胡紧套,胡适眼,湖淫娘,还会吹萧,换妻,爱液横流,浑圆豪乳,绩过后付,激情电,激情短,激情妹,激情炮,级办理,级答案,急需嫖,兼职上门,江胡内斗,江太上,江系人,江贼民,疆獨,自慰,姐包夜,姐服务,姐兼职,姐上门,精子射在,警察殴打,警方包庇,就爱插,考后付款,考机构,考前答案,考设备,考试包过,浪穴,老虎机,李洪志,理各种证,炼大法,猎枪销,六四事,陆封锁,乱奸,乱伦类,乱伦小,轮功,论文代,裸聊网,裸舞视,蟆叫专家,卖发票,卖银行卡,美艳少妇,妹按摩,妹上门,门按摩,门保健,門服務,迷奸药,迷情水,迷情药,谜奸药,蜜穴,明慧网,铭记印尼,摩小姐,幕前戲,内射,南充针,嫩穴,嫩阴,娘两腿之间,妞上门,浓精,女被人家搞,女激情,女上门,女優,喷尿,平叫到床,奇淫散,枪出售,枪销售,强权政府,清純壆,情聊天室,情妹妹,情视频,情自拍,请示威,群奸暴,人体艺,柔胸粉,肉洞,肉棍,乳交,赛后骚,三级片,骚妇,骚浪,骚穴,骚嘴,色电影,色妹妹,色视频,色小说,煽动不明,煽动群众,上门激,深喉,狮子旗,藏独,台独,疆独,十大禁,兽交,售步枪,售纯度,售单管,售弹簧刀,售防身,售狗子,售虎头,售火药,售假币,售军用,售猎枪,售氯胺,售麻醉,售冒名,售枪支,售热武,售三棱,售手枪,售五四,售信用,售一元硬,售子弹,售左轮,书办理,熟妇,术牌具,双管立,双管平,丝护士,丝情侣,丝袜保,丝袜恋,丝袜美,丝袜妹,丝足按,司法黑,素女心,速代办,速取证,涛共产,替考,替人体,透视扑,推油按,脱衣艳,袜按摩,外围赌球,湾版假,温家堡,温切斯特,温影帝,瘟加饱,瘟假饱,我搞台独,小穴,新疆叛,性爱日,性福情,性感少,颜射,要射精了,要射了,要泄了,夜激情,蚁力神,陰唇,陰道,陰戶,淫魔舞,淫情女,淫肉,淫騷妹,淫兽,淫兽学,淫水,淫穴,咏妓,用手枪,幼齿类,愚民政,与狗性,玉蒲团,冤民大,鸳鸯洗,韵徐娘,择油录,炸广州,炸立交,找枪手,找援交,真善忍,真实文凭,证到付款,证件办,殖器护,制服诱,制手枪,制证定金,中共黑,州大批贪,助考网,专业办理,专业代,专业代写,专业助,着护士的胸,自慰用,醉迷药,醉乙醚,做爱,肏,鸡巴,屄,反共,反党,反国家";
        String[] tmp = text.split(",");
        for (int k = 0;k<tmp.length;k++) {
            kws.add(tmp[k]);
        }

//        String text2 = "轮盘赌,安非他命,大麻,可卡因,海洛因,冰毒,摇头丸,杜冷丁,鸦片,罂粟,迷幻药,白粉,嗑药,道教,多维,佛教,佛祖,释迦牟尼,如来,阿弥陀佛,观世音,普贤,文殊,地藏,河殇,回教,密宗,摩门教,穆罕默德,穆斯林,升天,圣母,圣战,耶和华,耶稣,伊斯兰,真主安拉,白莲教,天主教,基督教,东正教,大法,法轮,法轮功,瘸腿帮,真理教,真善忍,转法轮,自焚,走向圆满,黄大仙,风水,跳大神,神汉,神婆,大卫教,阎王,黑白无常,牛头马面,藏独,高丽棒子,回回,疆独,蒙古鞑子,台独,台独分子,台联,台湾民国,西藏独立,新疆独立,南蛮,老毛子,回民吃猪肉,毛泽东,周恩来,刘少奇,朱德,彭德怀,林彪,刘伯承,陈毅,贺龙,聂荣臻,徐向前,罗荣桓,叶剑英,李大钊,陈独秀,孙中山,孙文,孙逸仙,邓小平,陈云,江泽民,李鹏,朱镕基,李瑞环,尉健行,李岚清,胡锦涛,罗干,温家宝,吴邦国,曾庆红,贾庆林,黄菊,吴官正,李长春,吴仪,回良玉,曾培炎,周永康,曹刚川,唐家璇,华建敏,陈至立,陈良宇,张德江,张立昌,俞正声,王乐泉,刘云山,王刚,王兆国,刘淇,贺国强,郭伯雄,胡耀邦,李登辉,连战,陈水扁,宋楚瑜,吕秀莲,郁慕明,蒋介石,蒋中正,蒋经国,马英九,习近平,李克强,杨尚昆,王光美,郭振家,陈秋平,蒋达德,陈忠财,樊金源,赵文淦,张国栋,石宗源,于永湛,桂晓风,杨牧之,任泽民,沈仁干,石峰,吴帮国,无帮国,无邦国,无帮过,瘟家宝,假庆林,甲庆林,假青林,离长春,习远平,袭近平,李磕墙,贺过墙,和锅枪,粥永康,轴永康,肘永康,周健康,粥健康,周小康,王刚,王乐泉,王兆国,王岐山,回良玉,刘淇,刘云山,刘延东,李长春,李克强,李源潮,吴邦国,汪洋,张高丽,张德江,周永康,胡锦涛,俞正声,贺国强,贾庆林,徐才厚,郭伯雄,温家宝,薄熙来,王立军,郭振家,李闽榕,蒋达德,陈忠财,樊金源,赵文淦,张国栋,国民党,打倒国民党,日本帝国,草泥马,达赖,布什,布莱尔,小泉,纯一郎,萨马兰奇,安南,阿拉法特,普京,默克尔,克林顿,里根,尼克松,林肯,杜鲁门,赫鲁晓夫,列宁,斯大林,马克思,恩格斯,金正日,金日成,萨达姆,胡志明,西哈努克,希拉克,撒切尔,阿罗约,曼德拉,卡斯特罗,富兰克林,华盛顿,艾森豪威尔,拿破仑,亚历山大,路易,拉姆斯菲尔德,劳拉,鲍威尔,奥巴马,本拉登,奥马尔,柴玲,达赖喇嘛,江青,张春桥,姚文元,王洪文,东条英机,希特勒,墨索里尼,冈村秀树,冈村宁次,高丽朴,赵阳,王丹,沃尔开西,李洪志,李大师,赖昌星,马加爵,班禅,额尔德尼,山本五十六,阿扁,阿扁万岁,热那亚,花革命,茉莉花,牡丹花,两会,中国茉莉花革命,中国茉莉花运动,ML花革命,ML花运动,ML花,梅花革命,牡丹花革命,映山红(金达莱)革命,葵花子政变,二十日,广场,东突厥斯坦,1989年6月4日,六四,六四运动,美国之音,民国,民进党,民运,民主,民主潮,纳粹,南华早报,明慧网,起义,亲民党,人民报,法轮大法,打倒共产党,台独万岁,示威,台湾岛国,台湾国,台湾独立,太子党,天安门事件,屠杀,新党,新疆分裂,新疆国,西藏分裂,西藏国,藏青会,藏妇会,学潮,学运,一党专政,一中一台,两个中国,一贯道,游行,圆满,镇压,政变,政治,政治反对派,政治犯,中共,共产党,反党,反共,政府,民主党,中国之春,共党,共匪,苏家屯,基地组织,塔利班,东亚病夫,支那,高治联,高自联,专政,专制,陆肆事件,九评,gongchandang,一党独裁,核工业基地,核武器,铀,原子弹,氢弹,导弹,核潜艇,大参考,小参考,国内动态清样,内蒙古抗议,内蒙古511,内蒙古511事件,内蒙古锡林郭勒盟,毛主席,3P,处女,奸杀,K粉,任弼时,房事,3P,新闻出版总署,血腥鎮壓,一黨,中國官方,獨裁政權,六四天安門,大屠殺,李鵬,專制,吾爾開希,高自聯,六四鎮壓,北高聯,天安門清场,第廿七軍,六四運動,天安門大屠殺,八九民運,八九學運,抗議鎮壓,反革命暴亂,向學生開槍,趙陽,罷課潮,烰嬅,獨立,達賴,臺灣獨立,藏獨,西藏獨立,疆獨,新疆獨立,台灣,李红痔,李宏志,李宏治,共铲,供产傥,供残傥,产傥,反黨,褪出,明Hui,minghui,氵去车人,氵去车仑工,氵去luｎ工,氵去luｎ功,氵去luｎ工力,法輪,法谪,法谪功,发抡功,法一轮,法十轮十功,珐輪功,法lun功,法L功,多黨,发轮,发伦,发抡,发沦,发囵,发仑,发纶,法纶,法沦,法抡,法愣,fa轮,下法轮,发论,抡功,伦功,轮大,法功,胡紧掏,胡锦滔,胡锦淘,江八点,江流氓,江则民,江泽慧,江贼,江独裁,江贼民,江折民,江澤民,江猪,江猪媳,江core,江ze民,江蛤蟆,将则民,僵贼,僵贼民,酱猪媳,毛厕洞,毛贼东,温加保,封杀酱猪媳,共黨,鄧小平,共產黨,黑社會,高幹,溫家寶,吳邦國,曾慶紅,黃菊,羅幹,賈慶林,朱溶剂,邓笑贫,美國之音,江澤泯,毛猪席,毛澤,朱榮機,大紀元,活摘人體,车仑工力,砝仑大砝,砝伦,砝轮,江昏君,江二世,江魔头,江浙民,法論,法论功,法伦,猪聋畸,供谠,胡紧套,胡錦濤,fa车仑工,正攵氵台,鎮壓,學生運動,還權,tianandoor,學運,m泽东,猪容鸡,胡紧逃,曾q红,温jb,胡jt,湖竟套,江戏子,李月月鸟,江路线,虎劲涛,瘟家饱,被增长,被自愿,反中游行,谭豁子,三呆婊,胡锦套,胡金淘,江泽泯,朱容鸡,腐败症腐,九评,九一评,ufconet,退党,tuidangepochtimes,三退热线,大纪元,大记元,大一纪,大纪园,共一党,邓颖超日记,人民内情真相,南大自由论坛,木子论坛,反社会,反人类,共狗,卖国,高薪养廉,独立中文笔会,邪党,中共暴政,9评,9平视频,退出党,腐败无救,灭中共,党邪恶,中共暴力,党的暴力,中国新民党,中国网民党,愚民政策,反民众,官僚精英,反共复国,收复大陆,消灭共产帝国,反共产,诛共匪,灭共党,反攻大陆,铲除共匪,pilibaoliao4pu,藏字石,中共专制,专制当局,内人党,挖肃,八路匪,sitesgooglecomsitezhongyuanxue,退出傥,共产专制,共产小丑,共产极权,共产王朝,共产无赖,中共迫害,中共走狗,中共恶霸,中共独枭,政治恶棍,政治小丑,共产党独裁,反封锁,反对党,贪污犯,官场经济,政府腐败,中共当局,洋奴哲学,联动分子,镇压群众,反共复民,反共复清,中国09年将面临更大的政治压力,中国09年面临更大的政治压力,达赖喇嘛流亡50周年,敏感的政治纪念日,公产档,工产谠,愚民教育,土共独裁,人权是奢侈,国营腐败,农村腐败,共惨党,中国民主党,民主流氓,中国过度政府,中華民國,共产党是骗子,反抗共产党,反对共产党,冤民大同盟,未来中国论坛,中国国家党,鲁迅公园绝食活动,香港民主派,土匪政权,供产档,拱产档,拱产谠,我恨警察,邪恶的党,杀人党,公产谠,大己元,大季元,中共独裁,贪官卖国,党的暴政,大gi元,脱离党,互害社会,中国政府不害怕互联网,中共邪灵,才有新中国,才能有新中国,gc党,党亡,中共谎言,公产党,共産党,退dang,tui党,共chan党,恶谠,gong惨谠,共惨谠,百年祸国,退出共产党,邪恶的共产党,解体党文化,解体中共,恶党,中共邪恶,官腐民盗,党震,共产党倒台,混帐政府,脑残教育,反華,communistparty,退共,邪恶组织,共产邪恶,中共黑帮,淫官,伪共党,蛮横的政策,土匪控制社会,土匪控制流氓,流氓控制农民,党是喝人血,党喝人血,中共维稳,变态帝制,褪党,党徒,天亡中共,天亡中一共,共一产一党,党的腐败,党腐败,共餐党,供产当,共产当,供惨谠,工产党,供产党,共产谠,拱产党,多妻养德,中共治下的中国,腐败大业,共产党邪教,党的邪教,共产主义歪理邪说,喝血社会,中共喉舌,假恶斗,摆脱党文化,退党,中共散毒,党文化污染,被党整,党打死,党迫害,党欺骗,党收瓜光,中共利用,中共迷惑,中共灭口,中共歪曲,中共愚弄,促退队,共产党,党下台,亡党,zhong共,中共灭亡,退出中共,杀人如麻的中共,中共政治迫害,共产党,唾党妈,退出了中共,退出了共产党,退出中国共产党,黑心党,shenshouorg,中共镇压,中共装阔,中共装摸作样,中共罪行,中共作恶,中共亵渎,中共戕害,中共鎮压,暴虐统治,腐财横行,共產党,党的流氓本性,党的杀人历史,党的邪恶,党根本没有人权,党走入坟墓,共奴,被党整过,告别中共,拱铲谠,拱铲谠,拱铲谠,拱铲谠,花季护航,绿坝娘,蓝坝娘,谠亡,亡谠,退谠,褪谠,拱产当,拱铲党,拱铲档,拱铲当,拱铲dang,拱chan谠,拱chan党,拱chan档,拱chan当,拱chandang,拱惨党,拱惨档,拱惨当,拱惨dang,拱産谠,拱産党,拱産档,拱産当,拱産dang,拱产dang,拱掺谠,拱掺党,拱掺档,拱掺当,拱掺dang,共铲谠,共铲党,共铲档,共铲当,共铲dang,共chan谠,共chan档,共chan当,共chandang,共惨档,共惨当,共惨dang,共産谠,共産档,共産当,共産dang,共产档,共产dang,共掺谠,共掺党,共掺档,共掺当,共掺dang,工铲谠,工铲党,工铲档,工铲当,工铲dang,工chan谠,工chan党,工chan档,工chan当,工chandang,工惨谠,工惨党,工惨档,工惨当,工惨dang,工産谠,工産党,工産档,工産当,工産dang,工产档,工产当,工产dang,工掺谠,工掺党,工掺档,工掺当,工掺dang,供铲谠,供铲党,供铲档,供铲当,供铲dang,供chan谠,供chan党,供chan档,供chan当,供chandang,供惨党,供惨档,供惨当,供惨dang,供産谠,供産党,供産档,供産当,供産dang,供产谠,供产dang,供掺谠,供掺党,供掺档,供掺当,供掺dang,公铲谠,公铲党,公铲档,公铲当,公铲dang,公chan谠,公chan党,公chan档,公chan当,公chandang,公惨谠,公惨党,公惨档,公惨当,公惨dang,公産谠,公産党,公産档,公産当,公産dang,公产当,公产dang,公掺谠,公掺党,公掺档,公掺当,公掺dang,gong铲谠,gong铲党,gong铲档,gong铲当,gong铲dang,gongchan谠,gongchan党,gongchan档,gongchan当,gong惨党,gong惨档,gong惨当,gong惨dang,gong産谠,gong産党,gong産档,gong産当,gong産dang,gong产谠,gong产党,gong产档,gong产当,gong产dang,gong掺谠,gong掺党,gong掺档,gong掺当,gong掺dang,功铲谠,功铲党,功铲档,功铲当,功铲dang,功chan谠,功chan党,功chan档,功chan当,功chandang,功惨谠,功惨党,功惨档,功惨当,功惨dang,功産谠,功産党,功産档,功産当,功産dang,功产谠,功产党,功产档,功产当,功产dang,功掺谠,功掺党,功掺档,功掺当,功掺dang,政匪,中共不灭,中共当权,中共党魁,中共的暴力,中共的暴烈,中共的打手,中共的大堕落,中共的恶戏,中共的恶行,中共的棺材,中共的谎话,中共的谎言,中共的教条,中共的烂疮,中共的流氓,中共的迷魂,中共的迫害,中共独权,中共流氓,抗议政府,纳粹中共,中共的险恶,中共险恶,中共的嘴脸,打到共产党,打到中央,打倒中央,中共头子,中共非法,烂党,烂政权,中共血腥,党卑鄙,gong产一谠,gong铲谠,tui谠,tui,退一档,退档,tui档,天一灭一中一共,天要亡供,天要亡共,弃欓,邪挡,邪谠,邪档,拱铲挡,共铲挡,工铲挡,供铲挡,公铲挡,gong铲挡,功铲挡,拱chan挡,共chan挡,工chan挡,供chan挡,公chan挡,gongchan挡,功chan挡,拱惨挡,共惨挡,工惨挡,供惨挡,公惨挡,gong惨挡,功惨挡,拱産挡,共産挡,工産挡,供産挡,公産挡,gong産挡,功産挡,拱产挡,共产挡,工产挡,供产挡,公产挡,gong产挡,功产挡,拱掺挡,共掺挡,供掺挡,gong掺挡,功掺挡,三民党,社会主义工人党,中国纳粹,中国的纳粹,中国人类进步党,中国月光工人协会党,暴力执政,中共的解体,中共解体,中共的罪恶,哄铲谠,哄铲谠,哄铲档,哄铲党,哄铲当,哄铲dang,哄铲挡,哄chan谠,哄chan党,哄chan档,哄chan当,哄chandang,哄chan挡,哄惨谠,哄惨党,哄惨档,哄惨当,哄惨dang,哄惨挡,哄産谠,哄産党,哄産档,哄産当,哄産dang,哄産挡,哄产谠,哄产党,哄产档,哄产当,哄产dang,哄产挡,哄掺谠,哄掺党,哄掺档,哄掺当,哄掺dang,哄掺挡,民主斗士,人权斗士,余杰,师涛,共谗党,正腐,贡产组织,拱铲裆,共铲裆,工铲裆,供铲裆,公铲裆,gong铲裆,功铲裆,哄铲裆,拱chan裆,共chan裆,工chan裆,供chan裆,公chan裆,gongchan裆,功chan裆,哄chan裆,拱惨裆,共惨裆,工裆,供惨裆,公惨裆,gong惨裆,功惨裆,哄惨裆,拱産裆,共産裆,工産裆,供産裆,公産裆,gong産裆,功産裆,哄産裆,拱产裆,共产裆,工产裆,供产裆,公产裆,gong产裆,功产裆,哄产裆,拱掺裆,共掺裆,工掺裆,供掺裆,公掺裆,gong掺裆,功掺裆,哄掺裆,拱残裆,共残裆,工残裆,供残裆,公残裆,gong残裆,功残裆,哄残裆,拱残谠,共残谠,工残谠,供残谠,公残谠,gong残谠,功残谠,哄残谠,拱残党,共残党,工残党,供残党,公残党,gong残党,功残党,哄残党,拱残档,共残档,工残档,供残档,公残档,gong残档,功残档,哄残档,拱残当,共残当,工残当,供残当,公残当,gong残当,功残当,哄残当,拱残dang,共残dang,工残dang,供残dang,公残dang,gong残dang,功残dang,哄残dang,拱残挡,共残挡,工残挡,供残挡,公残挡,gong残挡,功残挡,哄残挡,共谗谠,珙産當,人民需要反抗,痛恨这时代,痛恨着时代,胡石根,自由民主党,邪的教育,反共聯盟,反共联盟,中央无能,正义党,无国界记者,中国联邦主义,公产王朝,公产小丑,公产专制,脱离中共,贡谠,党蛊惑,反对中国共产党,启靖,社会民主党,兴华党,腐败的谠,腐败的党,批评谠,党黑,政治垄断,推翻中共,党太黑,党灭亡,党匪,党土匪,钟共,钟央,倒共救国,推翻共产党,中共垃圾,垃圾中共,中共欺骗,共产党亡,珙铲谠,栱铲谠,拱铲铛,産谠,剿共復國,剿共复国,殺朱拔毛,杀朱拔毛,脱离共谠,脱离共党,颠覆共党,中国人民党,拱谠,贡傥,供傥,退傥,邪傥,拱傥,中共專制,国家改革建议书,共产党wang,胡耀邦传,中共的残酷镇压,人权民运,军人骚乱,中华党,润涛阎,维权网义工,9ping,gong产组织,民族社会党,民族主义复兴党,新共党,独立知识分子,民主中国阵线,中国民主正义党,民聯陣,中國戰略研究所,中国工党,过渡政府,灭共檄文,gdzforg,guojiadangorg,futurechinaforumorg中华复兴党,中华联邦党,youmakercom,g匪,gcd是畜牲,强盗zf,和谐大旗,审江大联盟,共馋党,共啐党,共踹党,审氵工案,六０五决议,国家领导人的子女,温家宝之子,毛远新,毛泽民之子,习仲勋之子,李鹏之子李小鹏,吴百益,中国领导人的子女,中央领导人之子,拍马是一种高级艺术,二奶腐败,情妇腐败,官场缺德,罪恶展示,黄海谋刺,刺胡事件,江家帮,毛始皇,红朝邓二世,红朝皇帝,江系人马,江系干将,江系亲信,江系势力,913事件的真凶,913事件真凶,胡曾结盟,话说江核心,江胡大战,江氏迫害,毛太祖,毛二世,摆平胡锦涛,暴君,毛的淫威,毛魂附体,毛式共惨,毛式共产主义,毛是个怪胎,毛是中国的孤本,毛外交的偏激,毛一生血迹斑斑,残暴毛,本人的罪恶,本人整人一流,不会放过乘乱夺权,出卖中国,处男诗,当年阳谋,党天下,得意,的肮脏历史,的卑鄙行为,的地盘,的狗屁思想,的情人,的权力机器,的无诚信,的无厘头诗,的阴险,的愚弄,的整人术,的中共,关心唯一事情是夺权,号称混世魔王,黑洞,慌不择路,皇帝,近三十年暴政,留下的最大最坏的遗产,龙颜大悦,如此嗜杀,是暴君,是大流氓,思想的阴魂,统治,玩弄权术,一生反孔,一生姦污,依然阴魂不散,这个大和尚,这个历史的罪人,这类政治人物,毛主席纪念堂上市论,毛主席叫我咬谁我咬谁,毛主义的受害者,公审江泽民,瘟家暴,温家宝幕僚,温家宝自扇嘴巴,神奇的8341,神奇8341,神奇的老人,黄海事件,黄海暗杀,高干子弟,举着红旗反红旗,三个时期的旗帜,邓小平的政治交代,八三四一部队,中央警卫局,中办警卫局,公安部就局,中央警卫团,毛主席的qq,上级领导提倡的就是正确的,的qq,毛主席聊qq,聊qq,主席贴身保镖,主席的贴身保镖,总理的贴身保镖,总理贴身保镖,领导人保镖,领导人贴身保镖,毛泽南,毛泽西,毛泽北,黄海ci胡,黄海刺胡,主席保镖,中南海保镖,公审,独裁,邓矮,邓儿,主席领袖群伦,江吹拉弹唱粉墨登场,胡温除了流眼泪,特殊阶层,高干子女,军牌详解,中南海事件,重新评价,重评,邓小平失算,胡锦涛左右为难,摸黑,反毛方阵,田明建枪战,田明建事件,建国门事件,建国门枪战,田明建,胡锦涛下台,胡仅涛,恢复三民主义,庆红批阅,国母宋祖英,江泽民的情妇,江泽民情妇,江爷爷来背,中国高干,邓小平的恐女症,谁是胡温的接班人,打倒胡锦涛,梦网洪志,李三共志,宏志,末世论,群体灭绝,神通加持法,三退,慧网,法轮佛法,以血护法,张宏堡,法轮常转,远志明,遠志明,气官影片,家庭教会,江氏集团,善恶,自在游神,自由游神,大法新闻社,亚太正悟网,欧洲圆明网,澳洲光明网,正见网,新生网,放光明电视台,台湾放光明,新唐人电视,阿波罗网,大法之声,明毁网,洪法,19848146:8,法輪功,汕頭頻傳擄童割器官,高智晟,李洪之,明慧網,强摘器官,正大光明教,东方闪电,家庭基督教会,正見網,正見网,正见網,活体摘取器官,阿波罗新闻网,法轮圣王,法轮尊圣,珐轮工,falun,金牛教,陈鸽,珐仑,全能神,门徒会,女基督,呼喊派,李长寿,赵维山,话在肉身显现,东方发出的闪电,救主早已驾云重归,神向全宇发声,审判在神家起首,神隐秘的作工,圣灵末世的工作,圣灵向众教会说话,在光中行走,神的说话与人的交通,那灵在说话,基督的发表,你听见神的声音了吗,七号已经吹响,神在末世的发声,实际神,圣灵所使用,珐仑功,610歹徒,大法弟子,三去轮,610公安,610国保,610办公室,610绑架,610暴力,610不法人员,610不法之徒,610的恶棍,610的恶人,610的邪恶,610恶警,610恶人,610恶徒,610同伙,610基地,610恐怖,610狂妄,610迫害,610强化洗脑,610强行带走,610请来了已经邪悟的帮教人员,610头目,610头子,610洗脑,610邪恶,610与公安,610直接干的,70迫害,法x轮x功,zen1shanren3,zenshanren,大赦国际,大法學員,610办头目,610成员,fl功,大法好,保先邪恶活动,保鲜专栏毒害世人,法轮文化,活体实验,美西讲法,美西国际法会讲法,活体器官,大ji元,大圆满法,大善大忍,法正人间预,江泽民其人,江氏末政,京城血案的真相,法仑,中国之毁灭,自焚案惊人秘密,自焚还是骗局,洗脑班,大法的纯洁,大法资料,非法抓捕,被害学员,大法修炼,被毛整死,参与迫害的中共,明慧周报,明慧周刊,修炼大法,发愣工,法轮功,法轮功,法轮功,法l工力,法一轮一功,法轮一功,法一轮功,非法器官移植,非法镇压,诽谤大法,佛家大法,破坏大法,干扰大法,高智晟,六一○办公室,秘密关押,秘密监禁,苏家屯式的集中营,苏家屯式集中营,苏家屯集中营,苏家屯秘密集中营,苏家屯地下集中营,苏家屯式地下集中营,明慧编辑部,明慧的同修,明慧汇编,明慧图,明慧消息,明慧新闻,明慧周末,明慧资料,明慧广播,器官摘除,窃取活人皮肤,马列毒瘤,三去lung,三去lungong,三去车仑,摘取人体器官,hongzhi,盗取器官,摘取犯人器官,伪科学,610非法组织610恐怖机构,610恐怖组,610親,610组织,fa3车仑g,x教组织,dajiyuan,clearwisdomnet,epochtaiwannet,epochtimescom,epochtpeseednettw,gardennetworkscom,zhengjianorg,法l轮l功,minghuiorg,servebeercom,sodjycojp,unusualpersoncom,wujienet,zhonghua999com,北美大湖区法会上讲法,北美大湖区讲法,北美讲法,北美巡回讲法,不政治,长春讲法,长春解法,大法不可被利用,大法洪传时代,大法坚不可摧,大法金刚永纯,大法义解,大湖区讲法,弟子的伟大,江泽民推卸不了的历史责任,精进要旨,发出强大正念,发出正念,发正念,法正乾坤,法轮佛学,法轮图形,法轮修炼,法轮桩法,法轮组织,法轮周天法,法能破一切邪恶,法能破一切执著,非法拘留,非法抄家,非法关押,非法劳教,非法秘密判刑,非法秘密抓捕,非法判刑,非法取缔,非法抓走,纪元动态,纪元快讯,纪元特稿,纪元文化,纪元专栏,正法修炼,正法之路,正见书籍,正清网,氵去lun,珐伦,真sh忍,9一i平,da法好,神惩罚党,氵去仑,fa工力,轮公,轮攻,沦功,沦公,沦攻,论攻,论功,法论公,伦攻,伦公,法淪,法倫,發輪,發論,發淪,發倫,輪功,輪公,輪攻,淪功,淪公,淪攻,論攻,論功,論公,倫攻,倫功,倫公,大g元,法治大法,不信耶稣的人会下地狱,法抡工,万邦教会,万邦宣教教会,fa抡工力,会道门,主神教,中华养生益智功,旷野窄门,太比力克,沈昌特功,观音法门,闻香教,圆顿教,圆顿法门,被立王,国际中功总会,國際中功總會,灵灵教,三元教,乐施会,aboluowangcom,联合教会,城市教会,三赎基督,见证三赎,蒙福派,二两,囊帕拉,雪山狮子,次旺仁增,东突,东土耳其斯坦,西藏论坛,自由西藏,北京之春,自由时报,蔡崇国,北美自由论坛,亚洲自由之声,春夏自由论坛,正义党论坛,宇明网,蒙古国,统独论坛,台盟,台湾建国运动组织,台湾青年独立联盟,台湾政论区,台湾自由联盟,独立台湾会,建国党,乌伊会,世维会,西藏万岁,我的上师,反汉复藏,藏族独立,西藏之声,其美仁增,自由亚洲电台,达赖集团,踩踏佛像,藏国,白玉网,西藏要人权,西藏要人權,西藏要独立,蒙独,黑色之年,西藏妇女会,热比亚,热比娅,曹长青,西藏作为宗教国家,天佑台湾,1989年诺贝尔和平奖,印度爱藏,祝福达赖,西藏49秒,voanewscom,rfaorg,洛波桑,西藏平暴,雪山狮子旗,dalailama,西藏青年大会,前政治犯协会,西藏全国民主党,国际西藏运动,西藏委员会,西藏之友,西藏的控制,西藏的压制,拉顿德通,刚热,西藏团结委员会,西藏人民大起义运动,泰米尔猛虎,自杀式爆炸,索朗朗杰,迪考谭凯,旦正昂杰,夏珠活佛,门朗塔庆,格桑坚赞,西藏国家,西藏妇女协会,噶伦桑东,国际支持西藏网络,九十三运动,普布次仁仁波切,freetibet,達賴喇嘛,藏人国旗,藏人的国旗,桑东仁波切,比次仁,圣战组织,圣战培训班,东伊运,突厥斯坦伊斯兰党,东突解,世界维吾尔青年代表大会,苗独,台獨,世界维吾尔代表大会,熱比婭,热比婭,熱比娅,世界維吾爾代表大會,精神母亲,世维大会,世界维吾尔大会,迪里夏提,世界维吾尔族人大会,多里坤艾沙,多里坤艾沙,新纳粹,欧洲东突联盟,东突信息中心,阿不都吉力力,卡拉卡西,乌兹别克斯坦伊斯兰运动,阿卜杜勒,哈克,艾孜来提,真主党,东突民族党,维吾尔青年联盟,东突信息联络中心,蓝色蒙古,爱的10个条件,瑞典维吾尔人委员会,买买提,阿不都热合曼,艾山买合苏木,亚甫泉,新疆独立运动,卡日阿吉,吐尔逊,胡达拜尔地,阿西尔白克,亚生买买提,阿塔汗,阿不都艾尼,国际声援西藏运动,侯赛因江,事实独立,东北独立,四川独立,回民暴动,藏青會,西藏本非国土,我的喇嘛,艾买提,亚库甫,阿布都米吉提,夏米斯丁艾合麦提,艾可米来,吾买尔江,爱的十个条件,西藏血统,藏族血统,陈巧文,果洛拉加寺,祥萨仁波切,打压异族,达赖活佛,没有伤痕的酷刑,台灣獨立,新疆人,同香会,捅死一女两男,噶玛巴,扎西东知,1958008的恐惧,会见达赖,印度之子,起义日,反华活动,西藏抗暴,中共极左政策,我的土地我的人民,我的土地和我的人民,藏人社区,毁灭佛教,⒍4学潮,六四学潮,民运领袖,天安门母亲,六四天安,工自联,中国六四真相,坦克车从学生们的身上辗过,军队向人民开枪,坦克车压伤,六4事件,天安門事件,六四詩集,六四诗集,北京市高校学生自治联合会,北京工人自治联合会,六四镇压,六四屠杀,天安门屠杀,天安门清场,64事件,第二十七军,五一七宣言,四二二事件,天安门大屠杀,八九民运,八九学运,八九见证,六四政变,六四屠城,六四之役,六四母亲,六四血案,天安门录影带,89学潮,天安门四君子,64事件,张柏笠,天安门大学生事件,港支联,香港支联会,六肆,除报禁,六四惨案,五四谈话,六四风波,二六社论,北高联,六四尾声,六四民運,六四死难者,六四平反,六四动乱,六四暴乱,平反64,平反六四,tiananmenshijian,六．四运动,64学生运动,八九学生,六四惨案,六si死難,六四死難,64死難者,64死难,64运动,64运动,64学潮,6四事件,6四学潮,6泗,六泗,64血案,64学运,六四学运,六四之後,六四之后,學生運動,64遇難,六四遇难,64死難,勿忘六四,勿忘64,毋忘六四,毋忘64,六四民运,64民运,民运平反,liu四,liu泗,六si,六四纪念,纪念六四,64纪念,纪念64,64天安门,六四二十周年,六四0周年,64二十周年,民运二十周年,民运0周年,纪念89,89纪念,纪念八九,八九纪念,八九二十周年,89二十周年,八九0周年,六四屠殺,六四血腥,學潮,戒嚴,广场学生,46社论,516社论,绝食静坐,吳學燦,血洗政策,89年春夏之交,还我阳,高治聯,血洗京华,4．6社论,鲍彤,改革历程,国家囚徒,赵阳回忆录,军队屠城,64学潮,熊焱,熊炎,八九之后,89之后,静思节,禁食祷告日,唐荆陵,熱血可以換來自由,歷史的傷口,八九风波,89风波,靜思節,靜偲兯,靜偲節,6月fourth,怀念64,屠杀学生,屠杀大学生,悼念胡耀邦,二十年前天安门,政治風波,0年前天安门,张伯笠,学生运动,天安门的母亲,隐退的正义,同声哭泣,民主运动,鲍朴,64之前,雨夜送耀邦,逃离中国,64暴乱,民運,64天安,64真相,64真像,64詩集,64诗集,64镇压,64屠杀,64政变,64屠城,64之役,64母亲,64惨案,64风波,64尾声,64平反,64动乱,64之後,64之后,64屠殺,64血腥,64伤残,广场上的热血,热血洒广场,广场上的鲜血,鲜血洒广场,89天安门,89年天安门,学生动乱,廿周年,天安門,0週年,二十週年,鮑彤,鮑朴,改革歷程,廣場上的共和國,广场上的共和国,民主歷程,我的民主历程,民主運動,屠殺學生,李录,戒严令,64历史,民主化運動,64旁见,柴琳,柴铃,六一一四,6一一4,六一四,6一4,吾爾開,吾尔开西,泯运,戒严指挥,候德建,柴总指挥,北京动乱,天安门之魂,springof1989,天安门广场枪杀学生,天安门广场大屠杀,天安门广场民主运动,八九六四,64memocom,六四档案,天安门事变,血腥镇压,四月二十六日社论,八九北京事件,血洗京城,血洗北京,反革命暴乱,1989年春夏之交,封从德,郭海峰,赵长青,王有才,周锋锁,王维林,军民冲突,天安门被清场,陈一咨,苏晓康,学自联,邢铮,蘇曉康,河殤,外高联,1989天安门,鲍戈,六四图片,六四掺案,tiananmen事件,镇压学生事件,林昭,动乱分子,大学动乱,64屠城,89年学潮,八九年学潮,大学生闹天安门,镇压六四,89年6月,学潮暴乱,漆黑将不再面对,天安门母亲的呼唤,狐狸先生的尾巴,bloodisonthesquare,国共伪造的历史,的最后二十年,天安门路在何方,怎么看和怎么办,江上的母亲尘世挽歌,走近冰山,⑥四分子,坦克节,中共打压,5月35号,5月35日,北京大屠杀,中共屠城,镇压八九,中共倒台,六四纪念集会,严家其,陈一谘,万润南,梁擎暾,封丛德,王超华,李禄,王润生,陈宣良,鄭義,吕京花,王炳章,徐邦泰,韩联潮,刘永川,韩东方,赵品潞,方励之,李淑娴,伍凡,倪育贤,姚月谦,汤光中,吴宏达,沈彤,王若望,冯素英,杨建利,赵海青,朱嘉明,许家屯,鲁德成,徐文立,曹長青,唐元隽,陈荣利,周勇軍,林保华,陈达钲,吳海波,姜野飛,趙俊卿,袁紅冰,林保華,辛灝年,任畹町,吾尔开希,丁子霖,魏京生,蒋品超,谭作人,重建帝国,共和国之怒,中国特工,历史篡改者,小鹰号沉没,民殇,新中华战记,红旗漫漫,共和国049,国之利刃,北京战争,角落里的枪重建帝国0,我的文革岁月,hjt传,晚年周恩来,中国农村调查报告,圣床,国防资料调查科,中国废片,十七大前后的中国,邓力群自述,胡锦涛新传,北京政坛清华名人,人民心中的胡耀邦,和解的智慧,达赖喇嘛与中国,中国贪官在海外,中国超级富豪传奇,中共超级特工,生命树的分叉,中国官场情杀案环球事业,胡温全透视,爱滋村里的爱,未来的自由中国在民间,谁为腐败晚餐买单,行贿黑名单,递进民主,年轻时的赵阳,六四内部日记,陈伯达最后口述回忆,胡温治国揭秘,中南海面临的危机,图说文化大革命,林彪与文化大革命,民主不能等待,军报内部消息文革亲历,佛怀煽仇录,文化大革命图典,洪都女皇江青同志,专访赵阳,中国历史的见证,寻求六四,赵阳软禁中的谈话,中国的衰落,新发现的,李慎之文集,胡绩伟自选集,黄万里文集,哈维尔文集,怀念耀邦,李锐近作,图释世界史,厚黑大全,红楼里的女人,陈良宇秘密档案,红墙内的秘书们,红色领袖沉浮录,往事微痕,北京军方内参,中共内参,往事并不如烟,中国农民调查,呼唤英雄,维权诗集,失踪者的足迹,革命吞噬了它的女儿,执政春秋,一个解放军的1989,第五代中共18大主角,高洁的灵魂,光环背后的周恩来,天上人间公安部不敢查的秘密,七万言书,排华,印尼暴徒,集体强奸,印尼反华,印尼屠杀,印尼暴乱,98印尼,排華,印尼华人,屠华,巴新反华,反华暴动,反华大暴动,五月暴動,五月暴动,反华事件,九八年印尼,九八印尼,上访维权,维权联盟,访民,两会呈情,截访,维权人士,申冤维权,异议人士,申冤两会,两会申冤,两会监控升级,訪民,两会经费,维权博客,取缔网吧,上访两会,重回两会,雷议案,雷代表,人大代表无人选,政协委员党指定,医疗改革病难治,教育款如泰山重,贪官遍地罪难容,自由民主是何物,人权平等一场空,统计数字大掺水,维权更难血泪重,花言巧语欺百姓,人大只是举手会,政协更成拍手风,酒足饭饱会开罢,只见那昏惨惨邪灯将灭,人共愤三退潮涌,两会开幕云代表,邪党残暴似不见,民怨沸腾无人问,兴师动众七十万,层层截访层层拦,抓捕访民关黑牢,人民代表怕人民,党国奇观天下笑,会上反腐喊口号,末日来临回光照,亿万勇士弃中共,神州三退涌春潮,残暴狠毒恶贯满,滔天大罪天火烧,清除邪灵复华夏,世代高唱太平谣,進京诉冤,两会的大戏,两会大戏,两会提案为难,户籍制度违反宪法,中共监控,两会越辩越黑,你还是党的喉舌,问责会,员工砍死经理,顺义4s店事故,艺术家绝食,两会打瞌睡,李鸿忠抢女记者,李鸿忠怒抢女记者,威胁抢劫女记者,威胁女记者,您对邓玉娇案怎么看,两会最虚伪的官员,两会气死你,灭掉所有后,用医改灭掉,中国人必看,强暴,殴打,打砸烧事件,警察的冲突,殷彩霞,暴力拆迁,强制征地,强行征地,警民冲突,上访,围殴,冲击市委,踢翻小贩,万人围堵,暴动,警民对峙,围截铁路,大规模骚乱,执法犯法,杀人的警察,执法者犯法,警察打死,强行拘留,贪官,杀掉警察,打击警察,警察真恶心,游行抗议,官官相护,恶打,滥用枪支,暴打,毒打,强征土地,忽视农民,中国人很能骂,公安恶人,暴力执法,警车被掀,黑恶公安,伪法院,警察暴力,匪警,群众聚集,打伤小贩,血腥暴力,流血冲突,警察打人,邪警,结谠营私,爆乱,骚乱,见人就打,见车就砸,打人致死,暴乱,动乱,困官砸车,执法何在,带薪坐牢,打人公务员,公务员打人,官商联手,滥用政府权力,贪淫,流氓警察,被警察打,警察的暴行,官员奸淫,黑衙门,打人交警,有执照的流氓,警察杀人,警察禽兽,黑暗政府,强行拆迁,强制拆迁,官员恶,官员流氓,官匪,闵行倒钩门,政府太黑,政府太贪,政府太无能,官场腐败,钓鱼执法,tmd政府,抵制政府,政府是大爷,政府是爷,政府吃屎,政府他妈的,他妈的政府,霸王执法,合法土匪,中国的腐败,警察的腐败,官官相照,官官相通,官官相互,垃圾政府,打死人,官官勾结,警察腐败,军警毒打,军警殴打,政府垃圾,醉驾撞死,特大血案,替党说话,国家的黑暗,强拆,朱容基,滥用武力,围攻,群殴,渎职,势力的狗,闹事,深夜执法,大虹桥规划,郑州警方扫黄,粗暴执法,郑州扫黄,嫖资纠纷,学生暴动,抗議強拆,暴力拆房,艺术区遭拆迁,艺术区拆迁,开水有毒,有毒的不是开水,喝水死,施工暴徒,呼和浩特戒毒所,戒毒所遭强奸,睡觉死,亲友死在看守所,全国模范看守所,先谢国家,强奸致死,孙中界,王益,砍伤儿童事件,砍杀事件,砍伤19名师生,杀人事件,被砍事件,砍杀学生,砍杀小学生,砍人事件,幼儿园砍杀,幼儿园被砍杀,砍杀幼儿园,凶杀案,砍伤3人,踩踏事件,踩踏事故,本田,铝厂污染,群体性事件,村民游行,世博文化中心,执法犯罪,以权办案,以钱结案,权钱交易,警匪勾结,军匪勾结,残害百姓,暴力冲突,交警暴力,掀翻警车,官逼民反,重大事件,上万围攻,民众爆动,中国留学生,料理店,妓女,拆迁户,警察,地方势力,火葬场,洞口县,城管,民警,武警,黑车,警用执法车,阅兵仪式,恶警,公安,特警,绝对的弱者,军警,执法者,围观的群众,警车,公务员,当政者,陈雄杰,南汇,景逸鸣,小姐裸照,邓罗生,藝術家,长安街游行,艺术家长安街,王亚辉,活埋,郗红,何舍彪,周洋,不配合,索赔1万,王小丫,王小y,王小鸭,王小压,幼儿园,惨案,血案,世博,韩国馆,自制土炮,闹罢工,工人罢工,靖西,跳楼,自杀,维权,交警,派出所,回族,抗日,反日,网民诬告,游精佑,范燕琼,吴华英,福清纪委爆炸,南京近期要地震,中国地震局预报,地质学家的预言,学校血案频起,全怪隔壁幼儿园,前面左转是政府,砸你饭碗是城管,官商勾结我无罪,奶粉毒害的是你们,疫苗伤害的是你们,地震压死的是你们,成人用刀报复的也是你们,你们扫了爷爷的兴,你们扫了爷爷兴,你们扫了爷的兴,美国国家地震台网预测,南平血案,南平事件,雷州砍人,泰兴惨案,中国没有人权,幼儿园又遭毒手,校园伤害案,天上人间夜总会被查,天上人间都被查了,天上人间被查,天上人间是事业单位,失去了原有意义的世博会,世博能否推出中国价值观,沁园春房,房奴如潮,房奴滔滔,数天价楼盘,数天价楼市,平息不了西南人民的怨气,军队在锦州集结,军队集结完毕,国内恐慌,封索信息,农民自制土炮,轰退百人强拆队,马鞍山611事件,地铁爆炸,靖西事件,靖西肉搏事件,罢工事件,罢工潮,罢工维权,女大学生包养价格,包年生活费,哪个让你直播的,谁让你直播的,铲车事件,铲车撞人,铲车肇事,捍卫粤语,保护粤语,支持粤语,撑粤语,推普废粤,淄博博山机关幼儿园,周小川出逃,示威抗议,政府黑幕,严格封锁,官界黑暗,主子奴才和狗,游行的意义,背离了改革初衷,010诺贝尔和平奖,龙圩特大暴乱事件,反日游行,抗日游行,还我钓鱼岛,工人的觉醒,新工人运动,联通罢工,维护罢工,抵制联通,交警当街被杀,交警遇刺,持刀杀交警,杀死交警后,刺死警察,砸警车,集体罢工,出租车大罢工,出租车罢工,兲朝真理,真理部,不得报道,不得炒作,零八宪章,O八宪章,08宪章,零8宪章,张祖桦,09宪章,零九宪章,没有理由拒绝的宪章,世界人权宣言60周年,被删除文章,抵制央视,拒绝洗脑,抵制新闻联播,宣传联播,303名各界人士,劉曉波,二+六宪章,的三次方宪章,3宪章,91宪章,的3次方宪章,二的三次方宪章,二的3次方宪章,零八纲领,黄琦,网络革命宣言,零八憲章,难忘如火广场景,自记血浮帝王宫,道是无秦却有秦,贪风如虎吞三辰,天安门下泪汪洋,京华学子誓绝食,坦克狂奔追人碾,天安门下盈尸野,敢用炸子杀青年,人民军杀人民子,江婴,蒙汗药出售,迷奸药出售,强奸丸,淫荡迷情药,香烟迷药催眠迷幻药,速效迷奸药,失身粉,拍肩迷药出售,红蜘蛛迷奸药,迷魂药出售,迷情水出售,喷雾蒙汗药,迷奸香水出售,香水型迷奸药,少女迷奸药水,少女迷情药,西班牙苍蝇水,少女迷情粉货到付款,狂插男根胶囊,狂插性器具,SM后庭器具,制幻剂出售,女性自慰sex吧,淫荡肛交妹自慰器,操屄自慰器,花和尚社区成人性用品,美臀夹阴,波霸乳交器具,成人仿真抽插,灌肠自慰器,舔阴自慰器,淫荡自慰器,后庭专区,口交器具,抽插仿真器具,淫荡口交妹,前阴后庭抽插自慰器,肛栓母狗,男根增长sex吧,你母亲,视频裸聊,屄,肏,屌,马的,马白勺,妈的,妈白勺,女马ㄉ,女马的,女马白勺,操你,操妳,操他,操人也,操她,操女也,干你,干妳,干他,干人也,干她,干女也,超你,超妳,超他,超人也,超她,超女也,屌你,屌我,屌妳,屌他,屌人也,屌她,屌女也,凸你,凸我,凸妳,凸他,凸人也,凸她,凸女也,插你,插他,插我,插她,插妳,臭你,臭妳,臭他,臭人也,臭她,臭女也,机八,鸡八,G八,Ｇ八,机巴,鸡巴,G巴,Ｇ巴,机叭,鸡叭,G叭,Ｇ叭,机芭,鸡芭,G芭,Ｇ芭,机掰,鸡掰,G掰,Ｇ掰,机Y,机Ｙ,鸡Y,鸡Ｙ,机8,鸡８,靠爸,靠母,哭爸,哭母,靠北,老GY,老ＧＹ,干GY,干ＧＹ,操GY,操ＧＹ,超GY,超ＧＹ,臭GY,臭ＧＹ,干七八,干78,干７８,操七八,操78,操７８,超七八,超78,超７８,臭七八,臭78,臭７８,懒叫,懒教,妈B,我日,婊,璩美凤,阴茎,日你,阴道,干死,你妈,TNND,幼齿,干死你,作爱,阝月,歇逼,蛤蟆,发骚,招妓,阴唇,操你妈,精子,奸淫,菜逼,奶奶的,日死你,贱人,你娘,肛交,破鞋,贱逼,娘的,狗卵子,骚货,操蛋,大比,龟公,穷逼,欠日,狗b,牛逼,妈批,欠操,我操你,烂逼,你爸,屁眼,密穴,鸡奸,群奸,烂比,牛比,喷你,大b,小b,性欲,你大爷,淫荡,中国猪,狂操,婊子,我操,淫秽,狗屎,十八摸,操逼,二B,猪毛,狗操,奶子,大花逼,逼样,去你妈的,完蛋操,下贱,淫穴,猪操,阴水,操比,精液,卖比,16dy-图库,獸交,爱女人,拔出来,操b,插进,插穴,吃精,抽插,大乳,调教,黄色电影,激情电影,轮暴,迷奸,乳房,色猫,色欲,性爱图库,亚情,淫亂,淫女,淫蕩,淫水,淫汁,幼圖,中文搜性网,自慰,鷄巴,學生妹,１８歲淫亂,999日本妹,幹炮,摸阴蒂,金鳞岂是池中物,掰穴皮卡丘,白虎少妇,白虎阴穴,包二奶,暴淫,逼痒,蕩妹,肥逼,粉穴,干穴,开苞,口活,狼友,春药,风艳阁,激情小说,兽欲,全裸,秘唇,蜜穴,玉穴,应召,菊花蕾,大力抽送,干的爽,肉蒲团,后庭,淫叫,男女交欢,极品波霸,兽奸,流淫,销魂洞,操烂,成人网站,淫色,一夜欢,姦淫,给你爽,偷窥图片,性奴,大奶头,奸幼,中年美妇,豪乳,喷精,逼奸,脱内裤,发浪,浪叫,肉茎,菊花洞,成人自拍,自拍美穴,抠穴,颜射,肉棍,淫水爱液,阴核,露B,母子奸情,人妻熟女,色界,丁香社区,爱图公园,色色五月天,鹿城娱乐,色色,幼香阁,隐窝窝,乱伦熟女网,插阴,露阴照,美幼,97sese,嫩鲍鱼,日本AV女优,美女走光,33bbb走光,激情贴图,成人论坛,就去诱惑,浴室自拍,BlowJobs,激情裸体,丽春苑,窝窝客,银民吧,亚洲色,碧香亭,爱色cc,妹妹骚图,宾馆女郎,美腿丝足,好色cc,无码长片,淫水涟涟,放荡少妇,成人图片,黄金圣水,脚交,勾魂少妇,女尻,我要性交,SM女王,乳此丝袜,日本灌肠,集体性爱,国产骚货,操B指南,亚洲淫娃,熟女乱伦,SM舔穴,無碼H漫,大胆少女,乳此丰满,屄屄特写,熟女颜射,要色色,耻辱轮奸,巨乳素人,妩媚挑逗,骚姨妈,裸体少妇,美少妇,射奶,杨思敏,野外性交,风骚淫荡,白虎嫩B,明星淫图,淫乱熟女,高清性愛,高潮集锦,淫兽学园,俏臀摄魄,有容奶大,无套内射,毛鲍,3P炮图,性交课,激凸走光,性感妖娆,人妻交换,监禁陵辱,生徒胸触,東洋屄,翘臀嫩穴,春光外泻,淫妇自慰,本土无码,淫妻交换,日屄,近亲相奸,艳乳,白虎小穴,肛门喷水,淫荡贵妇,鬼畜轮奸,浴室乱伦,生奸内射,国产嫖娼,白液四溅,带套肛交,大乱交,精液榨取,性感乳娘,魅惑巨乳,无码炮图,群阴会,人性本色,极品波神,淫乱工作,白浆四溅,街头扒衣,口内爆射,嫩BB,肛门拳交,灌满精液,莲花逼,自慰抠穴,人妻榨乳,拔屄自拍,洗肠射尿,人妻色诱,淫浆,狂乳激揺,騷浪,射爽,蘚鮑,制服狩,無毛穴,骚浪美女,肏屄,舌头穴,人妻做爱,插逼,爆操,插穴止痒,骚乳,食精,爆乳娘,插阴茎,黑毛屄,肉便器,肉逼,淫亂潮吹,母奸,熟妇人妻,発射,幹砲,性佣,爽穴,插比,嫩鲍,骚母,吃鸡巴,金毛穴,体奸,爆草,操妻,a4u,酥穴,屄毛,厕所盗摄,艳妇淫女,掰穴打洞,盗撮,薄码,少修正,巧淫奸戏,成人片,换妻大会,破处,穴爽,g点,欢欢娱乐时空,近親相姦,裤袜,乱伦,买春,妹妹阴毛,免费成人网站,免费偷窥网,免费A片,摩洛客,嫩b,捏弄,女优,肉棒,骚姐姐,色区,色书库,射颜,手淫,兽交,吸精少女,下流地带,性虎,性饥渴,阴部,淫妹,淫图,幼交,欲火,援交妹,嫩屄,嫩女,噴精,情色天崖,情色文学,群交亂舞,日本骚货,肉唇,肉沟,肉棍干骚妇,肉壶,肉淫器吞精,骚妹,骚女,骚水,骚穴,色狐狸网址,色狼论坛";
//        String[] tmp2 = text2.split(",");
//        for (int k = 0;k<tmp2.length;k++) {
//            kws.add(tmp2[k]);
//        }
        kws.add("黄色");
        SensitiveService ss = new SensitiveService();
        for (String word: kws) {
            ss.addWord(word);
        }

        // 1、使用trie树
        String srcText = "2013年11月14日 - JAA正则表达式：Pattern类与Matcher类详解(转). java.util.regex是一个用正则表达式所订制的模式来对字符串进行苹果AB黄色的好吃吗？匹配工作的类库包。它包括两个 ...";
        int count = 100 * 10000;
        int i = 0;
        long start = System.currentTimeMillis();
        while (i++ < count) {
            boolean check = ss.check(srcText);
        }
        long end = System.currentTimeMillis();

        System.out.println("cost time：" + (end - start) + " ms.");


        // 2、使用string 的contains
        long start2 = System.currentTimeMillis();
        i = 0;
        while (i++ < count) {
            for (String word: kws) {
                boolean check = srcText.contains(word);
                if (check) {
                    break;
                }
            }

        }
        long end2 = System.currentTimeMillis();

        System.out.println("cost time2：" + (end2 - start2) + " ms.");


        // 3、使用正则表达式
        StringBuilder regex = new StringBuilder();
        for (int ii=0;ii<kws.size();ii++) {
            regex.append(kws.get(i));
            if (ii!=kws.size()-2) {
                regex.append("|");
            }
        }
        Pattern pattern = Pattern.compile(regex.toString());

        long start3 = System.currentTimeMillis();
        i = 0;
        while (i++ < count) {
            boolean check = Pattern.matches(srcText, pattern);
            if (check) {
                break;
            }
        }
        long end3 = System.currentTimeMillis();
        System.out.println("cost time3：" + (end3 - start3) + " ms.");


    }

}